# Taps
tap "aws/tap"
tap "beryju/tap"
tap "fluxcd/tap"
tap "goreleaser/tap"
tap "hashicorp/tap"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "matsuyoshi30/gitsu"
tap "norwoodj/tap"
tap "vmware-tanzu/tanzu"
# Core packages
brew "bat" # Replaces cat
brew "chezmoi"
brew "cloc"
brew "coreutils" # for greadlink etc
brew "htop"
brew "iperf3"
brew "libmagic"
brew "libpq", link: true # postgresql-client
brew "libxml2"
brew "nmap"
brew "screenfetch"
brew "starship"
brew "wget"
brew "zeromq"
brew "pkg-config" # needed for python package builds
brew "fish"
brew "fzf"
brew "mas" # https://github.com/mas-cli/mas
# DevOps Packages
brew "fluxcd/tap/flux"
brew "helm"
brew "norwoodj/tap/helm-docs"
brew "kompose"
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "matsuyoshi30/gitsu/gitsu"
brew "packer"
brew "stern"
brew "terraform"
brew "vault"
brew "jfrog-cli"
brew "rancher-cli"
# Code packages
brew "hugo"
brew "go"
brew "node@16"
brew "pipenv"
brew "golangci-lint"
brew "python@3.9"
brew "python@3.10"
# Casks
cask "1password"
cask "adoptopenjdk"
cask "alfred"
cask "discord-canary"
cask "discord"
cask "docker"
cask "font-fira-code-nerd-font"
cask "fork"
cask "iterm2"
cask "lunar"
cask "monitorcontrol" # Control screen brightness
cask "moom"
cask "paw"
cask "powershell"
cask "royal-tsx"
cask "spotify"
cask "stats"
cask "telegram"
cask "the-unarchiver"
cask "ticktick"
cask "visual-studio-code"
# App Store
mas "Amphetamine", id: 937984704
mas "MoneyMoney", id: 872698314
mas "Parcel", id: 639968404
mas "Unsplash Wallpapers", id: 1284863847
